# language: ru

@All
Функция: DNS-Shop

#  @checkCreditCalculator
#  Сценарий: Проверка работы калькулятора для расчета ипотеки на вторичное жилье
#    * Закрытие окна Cookie
#    * Выбор пункта Ипотека основного меню
#    * Выбор пункта Ипотека на вторичное жильё подменю
#    * Заполняем поля в формате поле/значение
#      | Стоимость недвижимости | 5180000 |
#      | Первоначальный взнос   | 3058000 |
#      | Скрок кредита          | 30      |
#    * Задаем состояние CheckBox 'Страхование жизни и здоровья' false
#    * Проверяем сумму кредита 2122000
#    * Проверяем ежемесячный платеж 20852
#    * Проверяем необходимый доход 35448
#    * Проверяем процентную ставку 11%

  @scenario-1_iPhone
  Сценарий: Проверка функциональности сайта Dns, поиск по iphone
    * Поиск продукта по запросу 'iphone'
#    * Изменить статус чекбокса Рейтинг на true
#    * В блоке Цена изменить значение поля 'до' на 150 000
#    * В блоке Цена изменить значение поля 'до' на 165 000
#    * В блоке NFC изменить значение checkBox 'есть' на true
    * В блоке Год релиза изменить значение checkBox '2018' на true
    * В блоке Год релиза изменить значение checkBox '2018' на true